[
  {
    "title": "NessIA.ca",
    "category": "Business website",
    "description": "Built for a client operating in the Business Intelligence space, this website outperforms competitors in speed, design and usability. It serves as a showcase for their services and as social proof via the Client and Partners section.",
    "technology": "The tool of choice these days for blazing fast websites is Gatsby. Its plugin architecture and Node API make website development a breeze.",
    "link": "https://nessia.ca/en",
    "image": "./src/assets/nessia.png",
    "alt": "NessIA homepage",
    "tags": ["javascript", "react", "gatsby", "bulma"]
  },
  {
    "title": "Huddol",
    "category": "Front End Development",
    "description": "React front end development work on the Huddol website and platform as part of a small development team. I mentored junior developers and cooperated with the CTO and my peers to get ideas to production as fast.",
    "technology": "Typical React/Redux application. Most of the codebase was of the early React adoption days so a major challenge which I enjoyed was to refactor enormous class components into well designed functional hook-based components for easier maintainability.",
    "link": "https://huddol.com",
    "image": "./src/assets/huddol_homepage.png",
    "alt": "Huddol homepage",
    "tags": ["javascript", "react", "redux", "jest", "emotion"]
  },
  {
    "title": "Digispeed.io",
    "category": "Business Website",
    "description": "Built for a client who needed an online presence for their business. The provided company logo influenced the design decisions. We chose to keep a simple document feeling to complement its black and white nature. Smooth animations and well designed icons improve the usability of the site.",
    "technology": "I believe in using the right tool for the job at hand. In this case, we needed a simple framework to quickly design and build a landing page. Gatsby is the obvious choice in this category, having all the features needed for navigation and extensibility. Bootstrap and Sass are used to power the CSS, and Netlify deploys the website at minimal costs.",
    "link": "https://digispeed.io",
    "image": "./src/assets/digispeed.png",
    "alt": "Digispeed homepage",
    "tags": ["javascript", "react", "gatsby", "bootstrap", "sass"]
  },
  {
    "title": "Netsweeper",
    "category": "Game",
    "description": "Neon cyberpunk minesweeper. Built for fun and to learn Phaser and Typescript.",
    "technology": "Netsweeper is built in TypeScript using the Phaser game engine. Since DOM Element Game Objects weren't supported in Phaser 3.16, React was used to create UI elements positioned on Game Objects. An xstate State Machine handles most of the gameplay logic.",
    "link": "https://freddydumont.itch.io/netsweeper",
    "image": "./src/assets/netsweeper.png",
    "alt": "netsweeper gameplay",
    "tags": ["typescript", "phaser", "react", "xstate", "emotion"]
  },
  {
    "title": "Star Wars Planet Guide",
    "category": "Typical interview project",
    "description": "A tool for Star Wars fans to browse and learn about the different planets of the Star Wars extended universe.",
    "technology": "The Planet Guide makes use of redux-saga to handle asynchronous events such as the API calls to SWAPI. The DevExtreme React Grid component is used to present the data in a table handling filtering, sorting and the display of detailed information.",
    "link": "https://freddydumont.github.io/star-wars-planet-guide/",
    "image": "./src/assets/starwars.png",
    "alt": "star wars planet guide",
    "tags": ["javascript", "react", "redux", "redux-saga", "bootstrap"]
  }
]
